#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.consumer_service will be updated in-place
  ~ resource "aws_ecs_service" "consumer_service" {
        cluster                            = "staging"
        deployment_maximum_percent         = 200
        deployment_minimum_healthy_percent = 100
        desired_count                      = 2
        enable_ecs_managed_tags            = false
        health_check_grace_period_seconds  = 0
        iam_role                           = "aws-service-role"
        id                                 = "arn:aws:ecs:eu-west-1:538653532257:service/consumer-service"
        launch_type                        = "FARGATE"
        name                               = "consumer-service"
        platform_version                   = "LATEST"
        propagate_tags                     = "NONE"
        scheduling_strategy                = "REPLICA"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:538653532257:task-definition/consumer-service:19" -> (known after apply)

        deployment_controller {
            type = "ECS"
        }

        load_balancer {
            container_name   = "consumer-service"
            container_port   = 8080
            target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:538653532257:targetgroup/consumer-service-target/398d6c2abaf384b3"
        }

        network_configuration {
            assign_public_ip = false
            security_groups  = [
                "sg-0b6c758f00d70d9a5",
                "sg-0f0b61f6ea9f636fb",
            ]
            subnets          = [
                "subnet-0ba62027c7b26273f",
            ]
        }
    }

  # aws_ecs_task_definition.consumer_service_task_def must be replaced
-/+ resource "aws_ecs_task_definition" "consumer_service_task_def" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:538653532257:task-definition/consumer-service:19" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu               = 0 -> null
                  - environment       = [] -> null
                  - essential         = true -> null
                  ~ image             = "538653532257.dkr.ecr.eu-west-1.amazonaws.com/consumer-service:c97e14d31767e99f6e5899a111489f7caf0e89e5" -> "538653532257.dkr.ecr.eu-west-1.amazonaws.com/consumer-service:232865bef12ae77b9a69d9d8c46cdd1fb20febb8"
                  ~ logConfiguration  = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group         = "/ecs/consumer-service"
                            awslogs-region        = "eu-west-1"
                            awslogs-stream-prefix = "ecs"
                        }
                      + secretOptions = null
                    }
                    memory            = 512
                    memoryReservation = 256
                  - mountPoints       = [] -> null
                    name              = "consumer-service"
                  ~ portMappings      = [
                      ~ {
                            containerPort = 8080
                            hostPort      = 8080
                          - protocol      = "tcp" -> null
                        },
                    ]
                  - volumesFrom       = [] -> null
                } # forces replacement,
            ]
        )
        cpu                      = "256"
        execution_role_arn       = "arn:aws:iam::538653532257:role/ecsTaskExecutionRole"
        family                   = "consumer-service"
      ~ id                       = "consumer-service" -> (known after apply)
        memory                   = "512"
        network_mode             = "awsvpc"
        requires_compatibilities = [
            "FARGATE",
        ]
      ~ revision                 = 19 -> (known after apply)
      - tags                     = {} -> null
        task_role_arn            = "arn:aws:iam::538653532257:role/ecs-task-default-role"
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Workflow: `Check PR`, Action: `hashicorpterraform-github-actions3`, Working Directory: `terraform`, Workspace: `default`*
